#+TITLE: Notes on Go's Language Specification
#+DATE: [2014-05-11 Sun 12:55]
#+KEYWORDS: refspec golang
#+SETUPFILE: ../org-templates/level-1.org

*** Constant expressions [fn:refspec_constant_expressions]
:PROPERTIES:
:CUSTOM_ID: ConstantExpressions
:END:

Constant expressions may contain only constant operands and are evaluated at compile time.

Untyped boolean, numeric, and string constants may be used as operands wherever it is legal to use an operand of boolean, numeric, or string type, respectively. Except for shift operations, if the operands of a binary operation are *different kinds* of untyped constants, the operation and, for non-boolean operations, the result use *the kind that appears later* in this list: integer, rune, floating-point, complex. For example, an untyped integer constant divided by an untyped complex constant yields an untyped complex constant.

A constant comparison always yields an untyped boolean constant. *If the left operand of a constant shift expression is an untyped constant, the result is an integer constant*; otherwise it is a constant of the same type as the left operand, which must be of integer type. Applying all other operators to untyped constants results in an untyped constant of the same kind (that is, a boolean, integer, floating-point, complex, or string constant).
#+BEGIN_SRC go
  const a = 2 + 3.0          // a == 5.0   (untyped floating-point constant)
  const b = 15 / 4           // b == 3     (untyped integer constant)
  const c = 15 / 4.0         // c == 3.75  (untyped floating-point constant)
  const Θ float64 = 3/2      // Θ == 1.0   (type float64, 3/2 is integer division)
  const Π float64 = 3/2.     // Π == 1.5   (type float64, 3/2. is float division)
  const d = 1 << 3.0         // d == 8     (untyped integer constant)
  const e = 1.0 << 3         // e == 8     (untyped integer constant)
  const f = int32(1) << 33   // illegal    (constant 8589934592 overflows int32)
  const g = float64(2) >> 1  // illegal    (float64(2) is a typed floating-point constant)
  const h = "foo" > "bar"    // h == true  (untyped boolean constant)
  const j = true             // j == true  (untyped boolean constant)
  const k = 'w' + 1          // k == 'x'   (untyped rune constant)
  const l = "hi"             // l == "hi"  (untyped string constant)
  const m = string(k)        // m == "x"   (type string)
  const Σ = 1 - 0.707i       //            (untyped complex constant)
  const Δ = Σ + 2.0e-4       //            (untyped complex constant)
  const Φ = iota*1i - 1/1i   //            (untyped complex constant)
#+END_SRC

#+BEGIN_SRC go :exports both :results output :imports '("fmt" "reflect")
  const i int8 = 1
  fmt.Printf("i<<2 =%d, type of i:%s", i<<2, reflect.TypeOf(i))
#+END_SRC

#+RESULTS:
: i<<2 =4, type of i:int8

